namespace Pishtova.Data.Seeding
{
	using Pishtova.Common;
	using Pishtova.Data.Model;
	using System;
	using System.Collections.Generic;
	using System.Linq;
	using System.Threading.Tasks;

    public class AuthorsSeeder : ISeeder
    {

		private static List<string> Authors => new()
		{
			"Христо Ботев",
			"Иван Вазов",
			"Алеко Константинов",
			"Пенчо Славейков",
			"Пейо Яворов",
			"Димчо Дебелянов",
			"Христо Смирненски",
			"Гео Милев",
			"Атанас Далчев",
			"Елисавета Багряна",
			"Елин Пелин",
			"Йордан Йовков",
			"Никола Вапцаров",
			"Димитър Талев",
			"Димитър Димов"
		};

		private static List<List<string>> Works => new()
		{
			new() { "Обща характеристика", "Майце си", "Към брата си", "До моето първо либе", "Елегия", "Борба", "Моята молитва", "На прощаване", "Хаджи Димитър", "Обесването на Левски" },
			new() { "Oбща  характеристика", "Отечество любезно", "Българският език", "При Рилският манастир", "Левски", "Кочо", "Паисий", "Опълченците на Шипка", "Линее нашто поколенье", "Елате ни   вижте", "Чичовци", "Дядо Йоцо гледа", "Под Игото" },
			new() { "Обща характеристика", "Разни хора, разни идеали", "Бай Ганьо" },
			new() { "Обща характеристика", "Ралица", "Cis Moll", "Сън за щастие" },
			new() { "Oбща характеристика", "Градушка", "Заточеници", "Ще бъдеш в бяло", "Две хубави очи", "Стон", "Две души", "Сенки", "Песента на човека", "Маска" },
			new() { "Обща характеристика", "Черна песен", "Пловдив", "Спи градът", "Миг", "Един убит", "Тиха победа", "Сиротна песен", "Да се завърнеш в бащината къща", "Помниш ли" },
			new() { "Обща характеристика", "Да бъде ден", "Ний", "Йохан", "Юноша", "Цветарка", "Стария музикант", "Зимни вечери" },
			new() { "Обща характеристика", "Септември" },
			new() { "Обща характеристика", "Болница", "Прозорец", "Стаята", "Къщата", "Повест", "Книгите", "Камък", "Дяволско" },
			new() { "Обща характеристика", "Кукувица", "Стихии", "Потомка", "Вечната" },
			new() { "Обща характеристика", "Косачи", "Задушница", "Гераците", "Ветрена мелница", "Андрешко", "Чорба от греховете на отец Никодим", "Занемелите камбани", "Мечтатели", "На оня свят" },
			new() { "Обща характеристика", "Серафим", "Последна радост", "Шибил", "През чумавото", "Индже", "Албена", "Другоселец", "Песента на колелетата" },
			new() { "Обща характеристика", "Вяра", "Писмо", "Песен за човека", "Прощално", "Сън", "История", "Кино", "Завод", "Борбата е безмислостно жестока" },
			new() { "Обща характеристика", "Железният светилник" },
			new() { "Обща характеристика", "Тютюн" },
		};

		public async Task SeedAsync(PishtovaDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.Authors.Any())
            {
                return;
            }
            for (int i = 0; i < Authors.Count; i++)
            {
				var author = new Author
				{
					Name = Authors[i],
					Index = i,
					Works = GetAuthorWork(Works[i])
				};
				 await dbContext.Authors.AddAsync(author);
            }
			await dbContext.SaveChangesAsync();

        }

        private static ICollection<Work> GetAuthorWork(List<string> worksName)
        {
			var works = new HashSet<Work>();
            for (int i = 0; i < worksName.Count; i++)
            {
				var work = new Work
				{
					Name = worksName[i],
					Index = i,
					SubjectId = GlobalConstants.BulgarianId
				};
				works.Add(work);
            }
			return works;
        }

    }
}
